Revit 2026 API

# ExportFontKey(ExportFontKey) Constructor

---

Constructs a new copy of the input ExportFontKey object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExportFontKey(
	ExportFontKey other
)
```
```vb
Public Sub New (
	other As ExportFontKey
)
```
```cpp
public:
ExportFontKey(
	ExportFontKey^ other
)
```
```fsharp
new :
        other : ExportFontKey -> ExportFontKey
```

#### Parameters

other ExportFontKey

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportFontKey Class

ExportFontKey Overload

Autodesk.Revit.DB Namespace